content/058/results/bombardier-medium.txt
Bombarding http://127.0.0.1:8765/medium?n=2000 for 15s using 50 connection(s)
 15s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     48582.21    1364.41   52820.65
  Latency        1.03ms   360.23us    12.12ms
  Latency Distribution
     50%   409.00us
     75%     1.85ms
     90%     2.63ms
     95%     3.26ms
     99%     4.90ms
  HTTP codes:
    1xx - 0, 2xx - 728772, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.38MB/s